// config.js
module.exports = {
    serverPort : 3333,
    SMPP: {
        IP_LIST: [
            '10.10.52.17'
            // '10.10.52.18',
            // '10.10.52.19',
            // '10.10.52.20',
            // '10.10.52.21',
            // '10.10.52.22',
            // '10.10.52.23',
            // '10.10.52.23'
        ],
        PORT: 5001,
        SYSTEM_ID: 'lbtest',
        PASSWORD: '123456',
        AUTO_ENQUIRE_LINK_PERIOD: 10000
    },
    WORKERS: {
        INSTANCE_COUNT: 1
    },
    BATCH: {
        SIZE: 1,  
    },
     APPROVED_USERS :[
        'MTNSYR\\amahayni',
        'MTNSYR\\khelsaidelmasri',
        'MTNSYR\\hahaidar',
        'MTNSYR\\rdamaa',
        'MTNSYR\\makadri',
        'MTNSYR\\vasadmin'
    ],

    notifyingNumbers :['963957222195'],

     badwords : [
        'أيمن زبيب', 'العرص', 'عرصة', 'عرص', 'العرصا', 'عرصا', 'عريص', 'العريص', 'المنيك', 'منيك',
        'منيوك', 'المنيوك', 'منيوكة', 'المنيوكة', 'المنيكة', 'النييك', 'النيك', 'النييكة', 'نييك', 'نيك',
        'نييكة', 'العرصة', 'الشلكة', 'شلكة', 'شلك', 'الشلك', 'الشلكتان', 'شلكتان', 'شلكين', 'الشلكين',
        'شرموطة', 'الشرموطة', 'شرمطة', 'الشرمطة', 'شرموط', 'الشرموط', 'شراميط', 'الشراميط', 'الكس', 'كس',
        'كسكوس', 'الكسكوس', 'كسيس', 'الكسيس', 'الكساكيس', 'كساكيس', 'كسكوسة', 'الكسكوسة', 'كسيسة', 'الكسيسة',
        'الكساكيسة', 'كساكيسة', 'كس برز', 'كس_برز', 'كساسة', 'كساس', 'كساسي', 'الكساسة', 'الكساس', 'الكساسي',
        'كسكسة', 'الكسكسة', 'طيز', 'طيازي', 'طزطوز', 'طيزي', 'طيزك', 'طيزيك', 'الطيز', 'الطيازي', 'الطزطوز',
        'الطيزي', 'الطيزك', 'الطيزيك', 'البز', 'بز', 'بزاز', 'البزاز', 'زيزة', 'زيزه', 'الزيزة', 'الزيزه',
        'البزبوز', 'بزبوز', 'حلمة', 'حلمه', 'أير', 'اير', 'الأير', 'الاير', 'أيور', 'الأيور', 'ايور', 'الايور',
        'الأيورا', 'الأيوره', 'الأيورة', 'الايورا', 'الايوره', 'الايوره', 'زب', 'الزب', 'زبزوب', 'الزبزوب',
        'زباب', 'الزباب', 'زبازيب', 'الزبازيب', 'الزبر', 'زبر', 'زبرة', 'الزبرة', 'زبي', 'زبك', 'زبين', 'زبور',
        'زبورك', 'الزبي', 'الزبك', 'الزبين', 'الزبور', 'الزبورك', 'طرنفيشة', 'الطرنفيشة', 'قضيب', 'القضيب',
        'قضيبي', 'قضيبك', 'القحبة', 'قحبة', 'قحب', 'القحب', 'قحبات', 'القحبات', 'أحبات', 'الأحبات', 'خرا',
        'الخرا', 'خرية', 'الخرية', 'خريه', 'الخريه', 'خرى', 'الخرى', 'خريا', 'الخريا', 'الخريات', 'خريات',
        'خرير', 'الخرير', 'خروات', 'الخروات', 'ممحون', 'الممحون', 'ممحونة', 'الممحونة', 'مماحين', 'المماحين',
        'ممحونين', 'الممحونين', 'محن', 'المحن', 'محنة', 'المحنة', 'الدغرة', 'الدغر', 'دغرة', 'دغر', 'دغرات',
        'الدغرات', 'داغرات', 'الداغرات', 'دكرة', 'الدكرة', 'الداكرات', 'داكرات', 'العاهرة', 'عاهر', 'عهر',
        'العهر', 'داعرة', 'الداعرة', 'داعرات', 'الداعرات', 'دعارة', 'الدعارة', 'بظر', 'البظر', 'زنبور', 'زمبور',
        'الزمبور', 'بخش', 'البخش', 'البخواش', 'بخواش', 'prostitution','fuck', 'Fuck', 'fuk', 'fucker', 'fuker', 'fcuk',
        'dick', 'deck', 'dik', 'dek', 'bitch', 'bich', 'fuckin', 'fuckn', 'أريدكسك', '"أريدكسك"', '*أريدكسك*',
        'سيكس', '"سيكس"', '*سيكس*', 'ابوزب', '"ابوزب"', '*ابوزب*', 'fuck\'n', 'fucking', 'Ass', 'asswhole',
        'asshole', 'asswhol', 'asshol', 'teat', 'nipple', 'cock', 'pussy', 'pussi', 'vagina', '*fuck*', 'wank*',
        '*shit*', 'tits', 'asshole', 'injun', 'masturbat*', 'Votze', 'b!tch', 'scheiss*', 'kurwa', 'fanculo',
        'rautenberg', 'bollock*', 'd4mn', 'titty', 'ayir', 'pimmel', 'ejackulate', 'kanker*', 'shit', 'cunt', 'ass',
        'plonker', 'dick*', 'cunt*', 'dick*', 'bitch*', 'Cock*', 'motherfucker', 'slut', 'pussy', 'prick', 'kike',
        'wop*', 'daygo', 'nigger', 'piss*', 'dego', 'whore', 'honkey', 'cum', 'breasts', 'nutsack', 'testicles',
        'clits', 'wank*', 'twat', 'gay', 'dago', 'c0ck', 'fuk*', 'penis', 'teets', 'bastard', 'twaty', 'assramer',
        'puta', 'faen', 'helvete', 'hore', 'kuk', 'fitte', 'kuksuger', 'pule', 'knulle', 'smut', 'boiolas',
        'futkretzn', 'muschi', 'fag*', 'Schlampe', 'Wichser', 'ficken', 'fcuk', 'yed', 'queef*', 'sphencter', 'cipa',
        'nepesaurio', 'titties', 'Huevon', 'Puto', 'Flikker', 'splooge', 'Fut', 'cazzo', 'pr0n', 'porn', 'fitta',
        'hui', 'spic', 'chink', 'gook', 'feg', 'nigga', 'h0r', 'fux0r', 'shiz', 'cawk', 'kawk', 'b17ch', 'b1tch',]
      
};




